Tekla Open API Reference for Tekla Structures 2025
Operation.MISExportTypeEnum Enumeration
 The MIS export types.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum MISExportTypeEnum
Public Enumeration MISExportTypeEnum
Members
Member name | Value | Description
DSTV | 0 |  The DSTV type.
KISS | 1 |  The KISS type.
EJE | 2 |  The EJE type.
EPC | 3 |  The EPC type.
STEEL2000 | 4 |  The STEEL2000 type.
See Also
Reference
Tekla.Structures.Model.Operations Namespace